alibaba/AliOS-Things/platform/mcu/lpc54102/mcuxpresso/startup_lpc5410x.c
__attribute__ ((section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
#if defined (CORE_M4)
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    __valid_user_code_checksum,        // LPC MCU checksum
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler
#else
    // Core Level -  CM0plus
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    0,                                 // Reserved
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler
#endif

    // External Interrupts - Available on M0+/M4
    WDT_IRQHandler,          // 16: Windowed watchdog timer, Brownout detect
    BOD_IRQHandler,          // 17: BOD interrupt
    Reserved18_IRQHandler,   // 18: Reserved interrupt
    DMA0_IRQHandler,         // 19: DMA controller
    GINT0_IRQHandler,        // 20: GPIO group 0
    PIN_INT0_IRQHandler,     // 21: Pin interrupt 0 or pattern match engine slice 0
    PIN_INT1_IRQHandler,     // 22: Pin interrupt 1or pattern match engine slice 1
    PIN_INT2_IRQHandler,     // 23: Pin interrupt 2 or pattern match engine slice 2
    PIN_INT3_IRQHandler,     // 24: Pin interrupt 3 or pattern match engine slice 3
    UTICK0_IRQHandler,       // 25: Micro-tick Timer
    MRT0_IRQHandler,         // 26: Multi-rate timer
    CTIMER0_IRQHandler,      // 27: Standard counter/timer CTIMER0
    CTIMER1_IRQHandler,      // 28: Standard counter/timer CTIMER1
    CTIMER2_IRQHandler,      // 29: Standard counter/timer CTIMER2
    CTIMER3_IRQHandler,      // 30: Standard counter/timer CTIMER3
    CTIMER4_IRQHandler,      // 31: Standard counter/timer CTIMER4
    SCT0_IRQHandler,         // 32: SCTimer/PWM
    USART0_IRQHandler,       // 33: USART0
    USART1_IRQHandler,       // 34: USART1
    USART2_IRQHandler,       // 35: USART2
    USART3_IRQHandler,       // 36: USART3
    I2C0_IRQHandler,         // 37: I2C0
    I2C1_IRQHandler,         // 38: I2C1
    I2C2_IRQHandler,         // 39: I2C2
    SPI0_IRQHandler,         // 40: SPI0
    SPI1_IRQHandler,         // 41: SPI1
    ADC0_SEQA_IRQHandler,    // 42: ADC0 sequence A completion.
    ADC0_SEQB_IRQHandler,    // 43: ADC0 sequence B completion.
    ADC0_THCMP_IRQHandler,   // 44: ADC0 threshold compare and error.
    RTC_IRQHandler,          // 45: RTC alarm and wake-up interrupts
    Reserved46_IRQHandler,   // 46: Reserved interrupt
    MAILBOX_IRQHandler,      // 47: Mailbox interrupt (present on selected devices)
    // External Interrupts - For M4 only
#if defined (CORE_M4)
    GINT1_IRQHandler,        // 48: GPIO group 1
    PIN_INT4_IRQHandler,     // 49: Pin interrupt 4 or pattern match engine slice 4 int
    PIN_INT5_IRQHandler,     // 50: Pin interrupt 5 or pattern match engine slice 5 int
    PIN_INT6_IRQHandler,     // 51: Pin interrupt 6 or pattern match engine slice 6 int
    PIN_INT7_IRQHandler,     // 52: Pin interrupt 7 or pattern match engine slice 7 int
    Reserved53_IRQHandler,   // 53: Reserved interrupt
    Reserved54_IRQHandler,   // 54: Reserved interrupt
    Reserved55_IRQHandler,   // 55: Reserved interrupt
    RIT_IRQHandler,          // 56: Repetitive Interrupt Timer
#endif


}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int *pulSrc = (unsigned int*) romstart;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************

#if defined (__MULTICORE_MASTER)
//#define  cpu_ctrl 0x40000300
//#define  coproc_boot   0x40000304
//#define  set coproc_stack  0x40000308
__attribute__ ((naked, section(".after_vectors.reset")))
void ResetISR(void) {
    asm volatile(
        ".set   cpu_ctrl,       0x40000300\t\n"
        ".set   coproc_boot,    0x40000304\t\n"
        ".set   coproc_stack,   0x40000308\t\n"
        "MOVS   R5, #1\t\n"
        "LDR    R0, =0xE000ED00\t\n"
        "LDR    R1, [R0]\t\n"           // READ CPUID register
        "LDR    R2,=0x410CC601\t\n"     // CM0 R0p1 identifier
        "EORS   R1,R1,R2\t\n"           // XOR to see if we are C0
        "LDR    R3, =cpu_ctrl\t\n"      // get address of CPU_CTRL
        "LDR    R1,[R3]\t\n"            // read cpu_ctrl reg into R1
        "BEQ.N  cm0_boot\t\n"
    "cm4_boot:\t\n"
        "LDR    R0,=coproc_boot\t\n"    // coproc boot address
        "LDR    R0,[R0]\t\n"            // get address to branch to
        "MOVS   R0,R0\t\n"              // Check if 0
        "BEQ.N  check_master_m4\t\n"    // if zero in boot reg, we just branch to  real reset
        "BX     R0\t\n"                 // otherwise, we branch to boot address
    "commonboot:\t\n"
        "LDR    R0, =ResetISR2\t\n"     // Jump to 'real' reset handler
        "BX     R0\t\n"
    "cm0_boot:\t\n"
        "LDR    R0,=coproc_boot\t\n"    // coproc boot address
        "LDR    R0,[R0]\t\n"            // get address to branch to
        "MOVS   R0,R0\t\n"              // Check if 0
        "BEQ.N  check_master_m0\t\n"    // if zero in boot reg, we just branch to  real reset
        "LDR    R1,=coproc_stack\t\n"   // pickup coprocesor stackpointer (from syscon CPSTACK)
        "LDR    R1,[R1]\t\n"
        "MOV    SP,R1\t\n"
        "BX     R0\t\n"                 // goto boot address
    "check_master_m0:\t\n"
        "ANDS   R1,R1,R5\t\n"           // bit test bit0
        "BEQ.N  commonboot\t\n"         // if we get 0, that means we are masters
        "B.N    goto_sleep_pending_reset\t\n"   // Otherwise, there is no startup vector for slave, so we go to sleep
    "check_master_m4:\t\n"
        "ANDS   R1,R1,R5\t\n"           // bit test bit0
        "BNE.N  commonboot\t\n"         // if we get 1, that means we are masters
    "goto_sleep_pending_reset:\t\n"
        "MOV     SP,R5\t\n"             // load 0x1 into SP so that any stacking (eg on NMI) will not cause us to wakeup
            // and write to uninitialised Stack area (instead it will LOCK us up before we cause damage)
            // this code should only be reached if debugger bypassed ROM or we changed master without giving
            // correct start address, the only way out of this is through a debugger change of SP and PC
    "sleepo:\t\n"
        "WFI\t\n"                       // go to sleep
        "B.N    sleepo\t\n"
    );
}

