alibaba/AliOS-Things/platform/mcu/lpc54102/mcuxpresso/startup_lpc5410x.c
WEAK void PIN_INT1_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT1_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void PIN_INT2_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT2_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void PIN_INT3_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT3_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void UTICK0_IRQHandler(void)
{  
   krhino_intrpt_enter();
   UTICK0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void MRT0_IRQHandler(void)
{
   krhino_intrpt_enter();
   MRT0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void CTIMER0_IRQHandler(void)
{
   krhino_intrpt_enter();
   CTIMER0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void CTIMER1_IRQHandler(void)
{
   krhino_intrpt_enter();
   CTIMER1_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void CTIMER2_IRQHandler(void)
{
   krhino_intrpt_enter();
   CTIMER2_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void CTIMER3_IRQHandler(void)
{
   krhino_intrpt_enter();
   CTIMER3_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void CTIMER4_IRQHandler(void)
{
   krhino_intrpt_enter();
   CTIMER4_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void SCT0_IRQHandler(void)
{  
   krhino_intrpt_enter();
   SCT0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void USART0_IRQHandler(void)
{   
   krhino_intrpt_enter();
   USART0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void USART1_IRQHandler(void)
{   
   krhino_intrpt_enter();
   USART1_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void USART2_IRQHandler(void)
{
   krhino_intrpt_enter();
   USART2_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void USART3_IRQHandler(void)
{
   krhino_intrpt_enter();
   USART3_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void I2C0_IRQHandler(void)
{
   krhino_intrpt_enter();
   I2C0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void I2C1_IRQHandler(void)
{
   krhino_intrpt_enter();
   I2C1_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void I2C2_IRQHandler(void)
{
   krhino_intrpt_enter();
   I2C2_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void SPI0_IRQHandler(void)
{
   krhino_intrpt_enter();
   SPI0_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void SPI1_IRQHandler(void)
{
   krhino_intrpt_enter();
   SPI1_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void ADC0_SEQA_IRQHandler(void)
{
   krhino_intrpt_enter();
   ADC0_SEQA_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void ADC0_SEQB_IRQHandler(void)
{
   krhino_intrpt_enter();
   ADC0_SEQB_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void ADC0_THCMP_IRQHandler(void)
{
   krhino_intrpt_enter();
   ADC0_THCMP_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void RTC_IRQHandler(void)
{
   krhino_intrpt_enter();
   RTC_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void Reserved46_IRQHandler(void)
{
   krhino_intrpt_enter();
   Reserved46_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void MAILBOX_IRQHandler(void)
{
   krhino_intrpt_enter();
   MAILBOX_DriverIRQHandler();
   krhino_intrpt_exit();
}
// External Interrupts - For M4 only
#if defined (CORE_M4)
WEAK void GINT1_IRQHandler(void)
{
   krhino_intrpt_enter();
   GINT1_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void PIN_INT4_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT4_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void PIN_INT5_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT5_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void PIN_INT6_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT6_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void PIN_INT7_IRQHandler(void)
{
   krhino_intrpt_enter();
   PIN_INT7_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void Reserved53_IRQHandler(void)
{
   krhino_intrpt_enter();
   Reserved53_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void Reserved54_IRQHandler(void)
{
   krhino_intrpt_enter();
   Reserved54_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void Reserved55_IRQHandler(void)
{
   krhino_intrpt_enter();
   Reserved55_DriverIRQHandler();
   krhino_intrpt_exit();
}

WEAK void RIT_IRQHandler(void)
{
   krhino_intrpt_enter();
   RIT_DriverIRQHandler();
   krhino_intrpt_exit();
}
#endif  // External Interrupts - For M4 only

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
